# Функция для отображения логотипа
display_logo() {
  echo -e '\e[0;37m'
  echo "███╗   ██╗ ██████╗ ██████╗ ███████╗███╗   ██╗ ██████╗ ██╗███╗   ██╗███████╗"
  echo "████╗  ██║██╔═══██╗██╔══██╗██╔════╝████╗  ██║██╔════╝ ██║████╗  ██║██╔════╝"
  echo "██╔██╗ ██║██║   ██║██║  ██║█████╗  ██╔██╗ ██║██║  ███╗██║██╔██╗ ██║█████╗  "
  echo "██║╚██╗██║██║   ██║██║  ██║██╔══╝  ██║╚██╗██║██║   ██║██║██║╚██╗██║██╔══╝  "
  echo "██║ ╚████║╚██████╔╝██████╔╝███████╗██║ ╚████║╚██████╔╝██║██║ ╚████║███████╗"
  echo "╚═╝  ╚═══╝ ╚═════╝ ╚═════╝ ╚══════╝╚═╝  ╚═══╝ ╚═════╝ ╚═╝╚═╝  ╚═══╝╚══════╝"                                                                       
  echo -e '\e[0m'

  echo -e "\nПідписуйтеся на канал Vitok про Bitok щоб бути в курсі самих актуальних нод - https://t.me/vitoooookBitok"
}

# Функция для логирования
log_message() {
  echo -e "\e[33m'$1'\e[0m"
}

# Отображение логотипа
display_logo
